In [1]:
import pandas as pd
df = pd.read_csv('agora.csv')

In [2]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

# Null value handaling

In [4]:
df.shape

(50, 5)

In [5]:
df.Transport.mean()

215331.73244897963

In [6]:
df.Transport.sum()/49

215331.7324489796

In [7]:
mean = df.Transport.mean()
mean

215331.73244897963

In [8]:
df.Transport = df.Transport.fillna(mean)
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Without Encoding

In [9]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [10]:
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[1,2,3])
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     2  191792.06
2        153441.51       101145.55  407934.54     3  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     3  166187.94

# Label Encoder

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
le = LabelEncoder()

In [13]:
df.Area = le.fit_transform(df.Area)

In [14]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     0  192261.83
1        162597.70       151377.59  443898.53     1  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     0  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# LABEL ENCODER USING FOR LOOP

In [15]:
import pandas as pd
import numpy as np
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [16]:
for column in df.columns:
    if df[column].dtype == np.number:
        continue
    df[column] = le.fit_transform(df[column])

<ipython-input-16-a645681004ae>:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype == np.number:

In [17]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# One Hot Encoding

In [18]:
import pandas as pd
import numpy as np
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [19]:
dummy = pd.get_dummies(df.Area)
dummy.head()

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

In [20]:
dummy = pd.get_dummies(df.Area,drop_first=True)
dummy.head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [21]:
df = df.drop('Area',axis=1)

In [22]:
df.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [24]:
df2 = pd.concat([df,dummy],axis=1)
df2.head()

   Marketing Spend  Administration  Transport     Profit  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83      1        0
1        162597.70       151377.59  443898.53  191792.06      0        0
2        153441.51       101145.55  407934.54  191050.39      0        1
3        144372.41       118671.85  383199.62  182901.99      1        0
4        142107.34        91391.77  366168.42  166187.94      0        1

In [25]:
X = df2.drop('Profit',axis=1)
Y = df2.Profit

In [27]:
X.head()

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10      1        0
1        162597.70       151377.59  443898.53      0        0
2        153441.51       101145.55  407934.54      0        1
3        144372.41       118671.85  383199.62      1        0
4        142107.34        91391.77  366168.42      0        1

In [30]:
newy = pd.DataFrame(Y)
newy.head()

      Profit
0  192261.83
1  191792.06
2  191050.39
3  182901.99
4  166187.94

# Ordinal Encoding

In [31]:
import pandas as pd
import numpy as np
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [32]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [35]:
cities = ['Dhaka', 'Ctg', 'Rangpur']

In [36]:
from sklearn.preprocessing import OrdinalEncoder

In [38]:
ordinal = OrdinalEncoder(categories = [cities])

In [49]:
enc = ordinal.fit_transform(df[['Area']])
encnew = pd.DataFrame(enc,columns=['Area'])
encnew.head()

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0

# Hashing Encoding

In [50]:
!pip install category_encoder

ERROR: Could not find a version that satisfies the requirement category_encoder
ERROR: No matching distribution found for category_encoder

In [54]:
import category_encoders as ce

In [63]:
category = ce.HashingEncoder(cols=['Area'],n_components=3)#shift+tab

In [64]:
category2 = category.fit_transform(df.Area)

In [65]:
category2.head()

   col_0  col_1  col_2
0      0      1      0
1      0      0      1
2      1      0      0
3      0      1      0
4      1      0      0